#ця частина коду початок спілкування
print('Привіт! Рада познайомитися!Я Одиниця, як звати тебе?')
vvid_name = input()
print('Дуже приємно, ', vvid_name)

#ця частина коду збирає дані про користувача
print("Система очікуватиме введення цілого числа!")
vvid_year = int(input("Мене цікавить твій вік, щоб я могла зрозуміти, на яку тему з тобою спілкуватись."))
print(vvid_year)
print (vvid_year+5)

vvid_height = float(input("Також, мені цікаво, якого ти зросту"))
print(vvid_height)

#ця частина коду опрацьовує декілька можливих варіантів рішень!



predmetu = ['фізика', 'хімія', 'математика', 'українська мова', 'англійська мова', 'біологія','технології','фізкультура', 'матаналіз', 'правознавство']
if vvid_year in range(6,11):
    print("О! Бачу ти ще школяр, певно тобі там важко даються деякі предмети!З яким предметом, ти не дружиш?")
    vvid_predmet = input()
    if vvid_predmet == predmetu[0]:
        print("Знаю такий предмет, навіть маю на цю тему анекдок! Сдухай...")
        print("Зустрічаються якось фізик і математик. Фізик запитує:")
        print("- Слухай, чому в поїзда колеса круглі, а коли він їде, вони стукають.")
        print("- Це елементарно. Площа круга - Пі Ер квадрат, так от цей квадрат  якраз і стукає.")
    elif vvid_predmet == predmetu[1]:
        print("Знаю такий предмет, навіть маю на цю тему анекдок! Сдухай...")
        print("Вчителька хімії питає учня:")
        print(" — Чому ти не робиш домашнє завдання з хімії? ")
        print(" — Тому що в мене немає реагентів!")
    elif vvid_predmet == predmetu[2]:
        print("Знаю такий предмет, навіть маю на цю тему анекдок! Сдухай...")
        print("Рахуйте перед сном інтеграли! Овечки це для слабаків.")
    elif vvid_predmet == predmetu[3]:
        print("Знаю такий предмет, навіть маю на цю тему анекдок! Сдухай...")
        print("— Хто знає, що таке «однорідні члени речення»?")
        print("— Це коли брат і сестра одночасно просять у тата грошей!")
    elif vvid_predmet == predmetu[4]:
        print("Знаю такий предмет, навіть маю на цю тему анекдок! Сдухай...")
        print("-Ну як? Були в тебе у Лондоні проблеми з твоїм англійським?")
        print("- В мене ні. В англійців були.")
    elif vvid_predmet == predmetu[5]:
        print("Знаю такий предмет, навіть маю на цю тему анекдок! Сдухай...")
        print("Ти знаєш, чим відрізняється біолог від зоолога?")
        print("— Біолог знає про тварин усе, а зоолог — навіть їхні клички!")
if vvid_year in range(12,18):
    print("O! Та ти вже студент!Вітаю, майже дорослий!!!Який предмет тобі подобається?")
    vvid_predmet = input()
    if vvid_predmet == predmetu[6]:
        print("Знаю такий предмет, навіть маю на цю тему анекдок! Сдухай...")
        print("— Вчителька на уроці технологій:")
        print("— Діти, сьогодні ми будемо шити. У кого є нитка?")
        print("— У мене є!- А голка?— Теж є!— А тканина?— … Немає.")
        print("— Ну тоді будемо робити проєкт «Швейна машина майбутнього — працює без тканини».")
    elif vvid_predmet == predmetu[7]:
        print("Знаю такий предмет, навіть маю на цю тему анекдок! Сдухай...")
        print("Вчені доказали, що 2 хв сміху є так само добре для здоров'я, як і 20 хв бігу, то я тепер")
        print("сиджу в парку і сміюся з тих, хто бігає")
    elif vvid_predmet == predmetu[8]:
        print("Знаю такий предмет, навіть маю на цю тему анекдок! Сдухай...")
        print("Що похідна сказала двом дзеркальним гілкам, з яких складається у = |x|?")
        print("Незважаючи на те, що одна з вас завжди позитивна, а інша негативна, я не можу вас розрізнити.")
    elif vvid_predmet == predmetu[9]:
        print("Знаю такий предмет, навіть маю на цю тему анекдок! Сдухай...")
        print("Судять учителя правознавства.Суддя запитує адвоката:Ваша лінія захисту?")
        print("Адвокат:  Він же правознавство викладав, а не право. Це різні предмети!")
        print("Суддя задумався... і пересів до нього на останню парту.")
