
students = [
     ["Подольськка","Раїса",2007,10,24],
     ["Фіцай", "Злата",2009,11,11],
     ["Магула", "Іванна",2009,12,23],
     ["Діденко", "Кіріл",2009,12,10],
     ["Черевко", "Ніколіна",1980,9,12],
    ["Гойбер", "Віталія", 2009,8,10],
    ["Джуган","Валік", 2015,10,11],
    ["Магула","Степан",2007,12,11],
    ["Чендей","Андрій", 2005,10,12],
    ["Михалчич","Дмитр",2003,1,4]
 ]
today_month = int(input("Введіть номер місяця сьогодні"))
today_day = int(input("Введіть число сьогодні"))

found = False
for s in students:
     year = s[2]
     month = s[3]
     day = s[4]
     if month == today_month and day == today_day:
         print("Сьогодні день народження у",s[1],s[0])
         found =True
if not found:
         print("Сьогодні ніхто не святкує день народження")

